Revit 2024 API
FailureHandlingOptions.SetClearAfterRollback Method
 Sets a flag indicating that Revit should clear all posted failures silently when the failing transaction is being rolled back intentionally. If not set, the failures may still be displayed to the user during rollback.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2011
Syntax
C#
public FailureHandlingOptions SetClearAfterRollback(
	bool bFlag
)
Visual Basic
Public Function SetClearAfterRollback ( _
	bFlag As Boolean _
) As FailureHandlingOptions
Visual C++
public:
FailureHandlingOptions^ SetClearAfterRollback(
	bool bFlag
)
Parameters
bFlag
Type: System.Boolean
 True to clear posted failures silently if the transaction is being rolled back, false to keep these failures in place (they may be displayed to the user).
Return Value
 This FailureHandlingOptions object.
See Also
FailureHandlingOptions Class
Autodesk.Revit.DB Namespace